app/controllers/kanjis_controller.rb

  def index
      @kanji = Kanji.first
---
SELECT "kanjis".* FROM "kanjis" ORDER BY "kanjis"."id" ASC LIMIT ?  [["LIMIT", 1]]

  def show
    @kanji = Kanji.find(params[:id])
---
SELECT "kanjis".* FROM "kanjis" WHERE "kanjis"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]